/**
 易慧婕-亲戚计算器  
 */
$(document).ready(function() {
	var displayBox = document.getElementById("display");
	var displayRes = document.getElementById("result");
	var mysex=" ";
	//relation show
    var set=[
            {"name":"我","爸爸":"爸爸","妈妈":"妈妈","哥哥":"哥哥","姐姐":"姐姐","丈夫":{"男":"同性","女":"丈夫"},"妻子":{"男":"妻子","女":"同性"},"弟弟":"弟弟","妹妹":"妹妹","儿子":"儿子","女儿":"女儿"},
			{"name":"爸爸","爸爸":"爷爷","妈妈":"奶奶","哥哥":"伯父","姐姐":"姑妈","丈夫":"同性","妻子":"妈妈","弟弟":"叔叔","妹妹":"姑妈","儿子":{"年长":"哥哥","年轻":"弟弟"},"女儿":{"年长":"姐姐","年轻":"妹妹"}},
			{"name":"妈妈","爸爸":"外公","妈妈":"外婆","哥哥":"舅舅","姐姐":"姨妈","丈夫":"爸爸","妻子":"同性","弟弟":"舅舅","妹妹":"姨妈","儿子":{"年长":"哥哥","年轻":"弟弟"},"女儿":{"年长":"姐姐","年轻":"妹妹"}},
			{"name":"爷爷","爸爸":"太公","妈妈":"太婆","哥哥":"伯公","姐姐":"姑奶奶","丈夫":"同性","妻子":"奶奶","弟弟":"叔伯","妹妹":"姑奶奶","儿子":{"年长":"伯父","年轻":"叔叔"},"女儿":"姑妈"},
			{"name":"奶奶","爸爸":"外太公","妈妈":"外太婆","哥哥":"舅公","姐姐":"姨婆","丈夫":"爷爷","妻子":"同性","弟弟":"舅公","妹妹":"姨婆","儿子":{"年长":"伯父","年轻":"叔叔"},"女儿":"姑妈"},
			{"name":"外公","爸爸":"外太公","妈妈":"外太婆","哥哥":"外伯公","姐姐":"姑姥姥","丈夫":"同性","妻子":"外婆","弟弟":"外伯公","妹妹":"姑姥姥","儿子":"舅舅","女儿":"姨妈"},
			{"name":"外婆","爸爸":"外太公","妈妈":"外太婆","哥哥":"外舅公","姐姐":"姑姥姥","丈夫":"外公","妻子":"同性","弟弟":"外舅公","妹妹":"姑姥姥","外姨婆":"舅舅","女儿":"姨妈"},
			{"name":"哥哥","爸爸":"爸爸","妈妈":"妈妈","哥哥":"哥哥","姐姐":"姐姐","丈夫":"同性","妻子":"嫂嫂","弟弟":{"年长":"哥哥","年轻":"弟弟"},"妹妹":{"年长":"姐姐","年轻":"妹妹"},"儿子":"侄子","女儿":"侄女"},
			{"name":"嫂嫂","爸爸":"姻伯父","妈妈":"姻伯母","哥哥":"姻兄","姐姐":"未知","丈夫":"哥哥","妻子":"同性","弟弟":"姻弟","妹妹":"未知","儿子":"侄子","女儿":"侄女"},
			{"name":"弟弟","爸爸":"爸爸","妈妈":"妈妈","哥哥":{"年长":"哥哥","年轻":"弟弟"},"姐姐":{"年长":"姐姐","年轻":"妹妹"},"丈夫":"同性","妻子":"弟媳","弟弟":"弟弟","妹妹":"妹妹","儿子":"侄子","女儿":"侄女"},
			{"name":"弟媳","爸爸":"姻叔父","妈妈":"姻叔母","哥哥":"姻兄","姐姐":"未知","丈夫":"弟弟","妻子":"同性","弟弟":"姻弟","妹妹":"未知","儿子":"侄子","女儿":"侄女"},
			{"name":"姐姐","爸爸":"爸爸","妈妈":"妈妈","哥哥":"哥哥","姐姐":"姐姐","丈夫":"姐夫","妻子":"同性","弟弟":{"年长":"哥哥","年轻":"弟弟"},"妹妹":{"年长":"姐姐","年轻":"妹妹"},"儿子":"外甥","女儿":"外甥女"},
			{"name":"姐夫","爸爸":"姻世伯","妈妈":"姻伯母","哥哥":"姻兄","姐姐":"未知","丈夫":"同性","妻子":"姐姐","弟弟":"姻弟","妹妹":"未知","儿子":"外甥","女儿":"外甥女"},
			{"name":"妹妹","爸爸":"爸爸","妈妈":"妈妈","哥哥":{"年长":"哥哥","年轻":"弟弟"},"姐姐":{"年长":"姐姐","年轻":"妹妹"},"丈夫":"妹夫","妻子":"同性","弟弟":"弟弟","妹妹":"妹妹","儿子":"外甥","女儿":"外甥女"},
			{"name":"妹夫","爸爸":"姻世伯","妈妈":"姻伯母","哥哥":"姻兄","姐姐":"未知","丈夫":"同性","妻子":"妹妹","弟弟":"姻弟","妹妹":"未知","儿子":"外甥","女儿":"外甥女"},
			{"name":"儿子","爸爸":{"男":"我","女":"丈夫"},"妈妈":{"男":"妻子","女":"我"},"哥哥":"儿子","姐姐":"女儿","丈夫":"同性","妻子":"儿媳妇","弟弟":"儿子","妹妹":"女儿","儿子":"孙子","女儿":"孙女"},
			{"name":"儿媳妇","爸爸":"亲家公","妈妈":"亲家母","哥哥":"姻侄","姐姐":"姻侄女","丈夫":"儿子","妻子":"同性","弟弟":"姻侄","妹妹":"姻侄女","儿子":"孙子","女儿":"孙女"},		
			{"name":"女儿","爸爸":{"男":"我","女":"丈夫"},"妈妈":{"男":"妻子","女":"我"},"哥哥":"儿子","姐姐":"女儿","丈夫":"女婿","妻子":"同性","弟弟":"儿子","妹妹":"女儿","儿子":"外孙","女儿":"外孙女"},
			{"name":"女婿","爸爸":"亲家公","妈妈":"亲家母","哥哥":"姻侄","姐姐":"姻侄女","丈夫":"同性","妻子":"女儿","弟弟":"姻侄","妹妹":"姻侄女","儿子":"外孙","女儿":"外孙女"},	
			{"name":"丈夫","爸爸":"公公","妈妈":"婆婆","哥哥":"大伯子","姐姐":"大姑子","丈夫":"同性","妻子":"我","弟弟":"小叔子","妹妹":"小姑子","儿子":"儿子","女儿":"女儿"},
			{"name":"妻子","爸爸":"丈人","妈妈":"丈母娘","哥哥":"大舅子","姐姐":"大姨子","丈夫":"我","妻子":"同性","弟弟":"小舅子","妹妹":"小姨子","儿子":"儿子","女儿":"女儿"},
			{"name":"姑妈","爸爸":"爷爷","妈妈":"奶奶","哥哥":{"年长":"伯父","年轻":"叔叔"},"姐姐":"姑妈","丈夫":"姑父","妻子":"同性","弟弟":{"年长":"伯父","年轻":"叔叔"},"妹妹":"姑妈","儿子":{"年长":"表哥","轻":"表弟"},"女儿":{"年长":"表姐","年轻":"表妹"}},
			{"name":"姑父","爸爸":"姻伯公","妈妈":"姻伯婆","哥哥":"姻世伯","姐姐":"姻伯母","丈夫":"同性","妻子":"姑妈","弟弟":"姻世伯","妹妹":"姻伯母","儿子":{"年长":"表哥","轻":"表弟"},"女儿":{"年长":"表姐","轻":"表妹"}},
			{"name":"叔叔","爸爸":"爷爷","妈妈":"奶奶","哥哥":{"年长":"伯父","年轻":"叔叔"},"姐姐":"姑妈","丈夫":"同性","妻子":"婶婶","弟弟":"叔叔","妹妹":"姑妈","儿子":{"年长":"堂哥","轻":"堂弟"},"女儿":{"年长":"堂姐","年轻":"堂妹"}},
			{"name":"婶婶","爸爸":"姻伯公","妈妈":"姻伯婆","哥哥":"姻世伯","姐姐":"姻伯母","丈夫":"叔叔","妻子":"同性","弟弟":"姻世伯","妹妹":"姻伯母","儿子":{"年长":"堂哥","轻":"堂弟"},"女儿":{"年长":"堂姐","年轻":"堂妹"}},
			{"name":"伯父","爸爸":"爷爷","妈妈":"奶奶","哥哥":"伯父","姐姐":"姑妈","丈夫":"同性","妻子":"伯母","弟弟":{"年长":"伯父","年轻":"叔叔"},"妹妹":"姑妈","儿子":{"年长":"堂哥","年轻":"堂弟"},"女儿":{"年长":"堂姐","年轻":"堂妹"}},
			{"name":"伯母","爸爸":"姻伯公","妈妈":"姻伯婆","哥哥":"姻世伯","姐姐":"姻伯母","丈夫":"伯父","妻子":"同性","弟弟":"姻世伯","妹妹":"姻伯母","儿子":{"年长":"堂哥","年轻":"堂弟"},"女儿":{"年长":"堂姐","年轻":"堂妹"}},
			{"name":"舅舅","爸爸":"外公","妈妈":"外婆","哥哥":"舅舅","姐姐":"姨妈","丈夫":"同性","妻子":"舅妈","弟弟":"舅舅","妹妹":"姨妈","儿子":{"年长":"表哥","年轻":"表弟"},"女儿":{"年长":"表姐","年轻":"表妹"}},
			{"name":"舅妈","爸爸":"未知","妈妈":"未知","哥哥":"未知","姐姐":"未知","丈夫":"舅舅","妻子":"同性","弟弟":"未知","妹妹":"未知","儿子":{"年长":"表哥","年轻":"表弟"},"女儿":{"年长":"表姐","年轻":"表妹"}},
			{"name":"姨妈","爸爸":"外公","妈妈":"外婆","哥哥":"舅舅","姐姐":"姨妈","丈夫":"姨夫","妻子":"同性","弟弟":"舅舅","妹妹":"姨妈","儿子":{"年长":"表哥","年轻":"表弟"},"女儿":{"年长":"表姐","年轻":"表妹"}},
			{"name":"姨夫","爸爸":"未知","妈妈":"未知","哥哥":"未知","姐姐":"未知","丈夫":"同性","妻子":"姨妈","弟弟":"未知","妹妹":"未知","儿子":{"年长":"表哥","年轻":"表弟"},"女儿":{"年长":"表姐","年轻":"表妹"}},
			{"name":"大伯子","爸爸":"公公","妈妈":"婆婆","哥哥":"大伯子","姐姐":"大姑子","丈夫":"同性","妻子":"大婶子","弟弟":{"年长":"大伯子","年轻":"小叔子"},"妹妹":{"年长":"大姑子","年轻":"小姑子"},"儿子":"侄子","女儿":"侄女"},
			{"name":"小叔子","爸爸":"公公","妈妈":"婆婆","哥哥":{"年长":"大伯子","年轻":"小叔子"},"姐姐":{"年长":"大姑子","年轻":"小姑子"},"丈夫":"同性","妻子":"小婶子","弟弟":"小叔子","妹妹":"小姑子","儿子":"侄子","女儿":"侄女"},
			{"name":"大姑子","爸爸":"公公","妈妈":"婆婆","哥哥":"大伯子","姐姐":"大姑子","丈夫":"姑丈","妻子":"同性","弟弟":{"年长":"大伯子","年轻":"小叔子"},"妹妹":{"年长":"大姑子","年轻":"小姑子"},"儿子":"侄子","女儿":"侄女"},
			{"name":"小姑子","爸爸":"公公","妈妈":"婆婆","哥哥":{"年长":"大伯子","年轻":"小叔子"},"姐姐":{"年长":"大姑子","年轻":"小姑子"},"丈夫":"姑丈","妻子":"同性","弟弟":"小叔","妹妹":"小姑","儿子":"侄子","女儿":"侄女"},
			{"name":"大舅子","爸爸":"丈人","妈妈":"丈母娘","哥哥":"大舅子","姐姐":"大姨子","丈夫":"同性","妻子":"舅嫂","弟弟":{"年长":"大舅子","年轻":"小舅子"},"妹妹":{"年长":"大姨子","年轻":"小姨子"},"儿子":"外甥","女儿":"外甥女"},
			{"name":"小舅子","爸爸":"丈人","妈妈":"丈母娘","哥哥":{"年长":"大舅子","年轻":"小舅子"},"姐姐":{"年长":"大姨子","轻":"小姨子"},"丈夫":"同性","妻子":"舅弟媳","弟弟":"小舅子","妹妹":"小姨子","儿子":"外甥","女儿":"外甥女"},
			{"name":"大姨子","爸爸":"丈人","妈妈":"丈母娘","哥哥":"大舅子","姐姐":"大姨子","丈夫":"大姨夫","妻子":"同性","弟弟":{"年长":"大舅子","年轻":"小舅子"},"妹妹":{"年长":"大姨子","年轻":"小姨子"},"儿子":"外甥","女儿":"外甥女"},
			{"name":"小姨子","爸爸":"丈人","妈妈":"丈母娘","哥哥":{"年长":"大舅子","年轻":"小舅子"},"姐姐":{"年长":"大姨子","年轻":"小姨子"},"丈夫":"小姨夫","妻子":"同性","弟弟":"小舅子","妹妹":"小姨子","儿子":"外甥","女儿":"外甥女"},
			{"name":"太公","爸爸":"未知","妈妈":"未知","哥哥":"未知","姐姐":"未知","丈夫":"同性","妻子":"太婆","弟弟":"未知","妹妹":"未知","儿子":{"年长":"伯父","年轻":"叔伯"},"女儿":"姑奶奶"},
			{"name":"太婆","爸爸":"未知","妈妈":"未知","哥哥":"未知","姐姐":"未知","丈夫":"太公","妻子":"同性","弟弟":"未知","妹妹":"未知","儿子":{"年长":"伯父","年轻":"叔伯"},"女儿":"姑奶奶"},
			{"name":"外太公","爸爸":"未知","妈妈":"未知","哥哥":"未知","姐姐":"未知","丈夫":"同性","妻子":"外太婆","弟弟":"未知","妹妹":"未知","儿子":"外伯公","女儿":"姑姥姥"},
			{"name":"外太婆","爸爸":"未知","妈妈":"未知","哥哥":"未知","姐姐":"未知","丈夫":"外太公","妻子":"同性","弟弟":"未知","妹妹":"未知","儿子":"外伯公","女儿":"姑姥姥"},
			{"name":"孙子","爸爸":"儿子","妈妈":"儿媳妇","哥哥":"孙子","姐姐":"孙女","丈夫":"同性","妻子":"孙媳妇","弟弟":"孙子","妹妹":"孙女","儿子":"未知","女儿":"未知"},
			{"name":"孙女","爸爸":"儿子","妈妈":"儿媳妇","哥哥":"孙子","姐姐":"孙女","丈夫":"孙女婿","妻子":"同性","弟弟":"孙子","妹妹":"孙女","儿子":"未知","女儿":"未知"},
			{"name":"外孙","爸爸":"女婿","妈妈":"女儿","哥哥":"外孙","姐姐":"外孙女","丈夫":"同性","妻子":"外孙媳妇","弟弟":"外孙","妹妹":"外孙女","儿子":"未知","女儿":"未知"},
			{"name":"外孙女","爸爸":"女婿","妈妈":"女儿","哥哥":"外孙","姐姐":"外孙女","丈夫":"外孙女婿","妻子":"同性","弟弟":"外孙","妹妹":"外孙女","儿子":"未知","女儿":"未知"},
			{"name":"舅嫂","爸爸":"姻伯父","妈妈":"姻伯母","哥哥":"姻兄","姐姐":"未知","丈夫":"大舅子","妻子":"同性","弟弟":"姻弟","妹妹":"未知","儿子":"内侄","女儿":"内侄女"},
			{"name":"舅弟媳","爸爸":"姻叔父","妈妈":"姻叔母","哥哥":"姻兄","姐姐":"未知","丈夫":"小舅子","妻子":"同性","弟弟":"姻弟","妹妹":"未知","儿子":"内侄","女儿":"内侄女"},
			{"name":"姑姥姥","爸爸":"外太公","妈妈":"外太婆","哥哥":"外伯公","姐姐":"姑姥姥","丈夫":"姑姥爷","妻子":"同性","弟弟":"外伯公","妹妹":"姑姥姥","儿子":"姑表伯父","女儿":"姑表姑母"},
			{"name":"姑奶奶","爸爸":"太公","妈妈":"太婆","哥哥":"伯公","姐姐":"姑奶奶","丈夫":"姑爷爷","妻子":"同性","弟弟":"伯公","妹妹":"姑奶奶","儿子":"姑表舅父","女儿":"姑表姨母"},
			{"name":"姻世伯","爸爸":"未知","妈妈":"未知","哥哥":"未知","姐姐":"未知","丈夫":"同性","妻子":"姻伯母","弟弟":"未知","妹妹":"未知","儿子":"未知","女儿":"未知"},
			{"name":"姻伯母","爸爸":"未知","妈妈":"未知","哥哥":"未知","姐姐":"未知","丈夫":"同性","妻子":"姻世伯","弟弟":"未知","妹妹":"未知","儿子":"未知","女儿":"未知"},
			{"name":"姻伯公","爸爸":"未知","妈妈":"未知","哥哥":"未知","姐姐":"未知","丈夫":"同性","妻子":"姻伯婆","弟弟":"未知","妹妹":"未知","儿子":"未知","女儿":"未知"},
			{"name":"姻伯父","爸爸":"未知","妈妈":"未知","哥哥":"未知","姐姐":"未知","丈夫":"同性","妻子":"姻伯母","弟弟":"未知","妹妹":"未知","儿子":"未知","女儿":"未知"},
			{"name":"姻叔父","爸爸":"未知","妈妈":"未知","哥哥":"未知","姐姐":"未知","丈夫":"同性","妻子":"姻叔母","弟弟":"未知","妹妹":"未知","儿子":"未知","女儿":"未知"},
			{"name":"未知","爸爸":"未知","妈妈":"未知","哥哥":"未知","姐姐":"未知","丈夫":"未知","妻子":"未知","弟弟":"未知","妹妹":"未知","儿子":"未知","女儿":"未知"},
			{"name":"同性","爸爸":"未知","妈妈":"未知","哥哥":"未知","姐姐":"未知","丈夫":"未知","妻子":"未知","弟弟":"未知","妹妹":"未知","儿子":"未知","女儿":"未知"}
	];
	    //relation list
		var myre = [];
		myre.push("我");
		//age list
		var ageCompare = [];
		var result ;

    //clear
    $("#calu-func").click(function() {
		generalRes();
		displayBox.innerHTML = "我";
		displayRes.innerHTML = "我";
		myre = [];
		myre.push("我");
		ageCompare = [];
	  });
	  
    //back and calculate again
    $("#back").click(function() {
		generalRes();
        var string = displayBox.innerHTML;
        num = string.length;
        if(num > 1 && string !== "NaN"){
		   displayBox.innerHTML = string.substring(0,num-3);
		   myre.pop();
		   result = evalAgain();
		   displayRes.innerHTML = result;
		}
		else displayBox.innerHTML = '我';
      });
    
    $(".relation-btn").click(function(){
		generalRes();
		var relative =  $(this).attr("value");
		var start = displayRes.innerHTML;
		myre.push(relative);
		displayBox.innerHTML = displayBox.innerHTML.concat("的");
		displayBox.innerHTML = displayBox.innerHTML.concat(relative);
		result = simplifyTwoToOne(start,relative);
		judge();
		//console.log(result);
		if(typeof(result) === "string"){
			if( result === "未知"|| result === " ") result = "关系太远了，随便叫叫吧！";
		    if( result === "同性") result = "暂无同性称呼，但是真爱无敌!";
			displayRes.innerHTML = result;
		}
	});
	//old or young
	$(".btn-age").click(function(){
		var age =  $(this).attr("value");
        ageCompare.push(age);
		generalBtn();
		result = result[age] ;
		displayRes.innerHTML = result;
	});
    //show result and add a record
    $("#equals").click(function() {
		highlightRes();
		var string = "<p>"+displayBox.innerHTML+"="+displayRes.innerHTML+"</p>";
		$(".record").append(string);
	  });
	//highlight result
	function highlightRes(){
		var res = document.getElementById("result");
		var dis = document.getElementById("display");
		res.style.cssText = "color:#292929; font-size:45px;";
		dis.style.cssText = "color:#999; font-size:30px;"
	}
	//general result
	function generalRes(){
        var res = document.getElementById("result");
		var dis = document.getElementById("display");
	    dis.style.cssText = "color:#292929; font-size:45px;";
		res.style.cssText = "color:#999; font-size:30px;"
	}
	
	//personal sex
	function getSex(){
		var sex = document.getElementsByName("sex");
		for (var i in sex){
			if(sex[i].checked == true){
				mysex = sex[i].value;
			}
		}
	}
	//only click old and young button
    function showOldOrY(){
		$("button").attr("disabled",true);
		$("#op").attr('disabled', false);
		$("#yp").attr('disabled', false);
	}
	//genaral button,click relation button
	function generalBtn(){
		$("button").attr("disabled",false);
		$("#op").attr('disabled', true);
		$("#yp").attr('disabled', true);
	}
	//check relation show to find a calling,actual calculating
	function simplifyTwoToOne(whose,who){
		var call = " ";
        for(var i in set){
			if( whose == set[i].name ){
				call = set[i][who];	
			}
		}
		if( call === "未知"|| call === " ") call = "关系太远了，随便叫叫吧！";
		if( call === "同性") call = "暂无同性称呼，但是真爱无敌!";
		return call;
	}
	//after back ,calculate
	function evalAgain(){
		var theRe = myre.slice(0,myre.length);
		var theAge= ageCompare.slice(0,ageCompare.length);
		while(theRe.length !== 1){
		if(theRe.length >= 2){
			var call = simplifyTwoToOne(theRe[0],theRe[1]);
			if(typeof(call)!== "string"){
				if(call["年长"]){
					call = call[theAge[0]];
					theAge.shift();
				}
				if(call["男"]){
					getSex();
					call = call[mysex];
				}
			} 
			if ( call.length > 10) return call;
			else {
				theRe.shift();
				theRe.shift();
				theRe.unshift(call);
			}
		}}
		var remainAgeLength = theAge.length;
		for(var i = 1;i<=remainAgeLength;i++)
		ageCompare.pop();
		console.log(myre);
		console.log(theRe);
		return theRe[0];
	}
	//judge age and sex when input
	function judge(){
		if(typeof(result)!== "string"){
			if(result["年长"]){
				showOldOrY();
			}
			if(result["男"]){
				getSex();
				result = result[mysex];
			}
		} 
		//console.log(result);
	}
});